//Данные о станций метро для построения маршрута
export interface MetroStation {
  name: string;
  line: string;
  lat: number;
  lng: number;
}

//Тестовые станции
export const metroStations: MetroStation[] = [
  {
    name: "Тверская",
    line: "Замоскворецкая линия",
    lat: 55.7656,
    lng: 37.6048,
  },
  {
    name: "Пушкинская",
    line: "Таганско-Краснопресненская линия",
    lat: 55.7656,
    lng: 37.6040,
  },
  {
    name: "Арбатская",
    line: "Арбатско-Покровская линия",
    lat: 55.7521,
    lng: 37.6030,
  },
  {
    name: "Арбатская",
    line: "Филёвская линия",
    lat: 55.7521,
    lng: 37.6030,
  },
  {
    name: "Китай-город",
    line: "Калужско-Рижская линия",
    lat: 55.7567,
    lng: 37.6330,
  },
  {
    name: "Китай-город",
    line: "Таганско-Краснопресненская линия",
    lat: 55.7567,
    lng: 37.6330,
  },
  {
    name: "Чистые пруды",
    line: "Сокольническая линия",
    lat: 55.7650,
    lng: 37.6384,
  },
];